# CombineIntoSurface

## Description
Creates a polyline from the bounded selection surrounding the inIncludedPoint.

```pascal
FUNCTION CombineIntoSurface(pt : REAL) : HANDLE;
```

```python

def vs.CombineIntoSurface(pt):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt|REAL|A point within the bounded selection.|

## Version
Availability: from VectorWorks10.1
## Category
* Objects - 2D